###  "Shift + Tab", para ver documentação.

In [1]:
import pandas as pd

## Series
##### nada mais é que um array de 1 dimensão. Você pode considerar um Series também como uma coluna de uma tabela

In [2]:
s = pd.Series([3,-5,7,4], index =['index 1' , 'index 2' , 'index 3', 'index 4'])
s

index 1    3
index 2   -5
index 3    7
index 4    4
dtype: int64

## DataFrame
##### Um DataFrame é simplesmente um conjunto de Series. Trata-se de uma estrutura de dados de 2 dimensões — colunas e linhas — que transforma os dados em uma bela tabela

In [3]:
data = {
'País': ['Bélgica', 'Índia', 'Brasil'],
'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília'],
'População': [123465, 456789, 987654]
}

df = pd.DataFrame(data, columns=["País", "Capital" , "População"])
df

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

##  Para ler arquivos CSV

In [4]:
dados = pd.read_csv("dados/aluguel.csv", sep =';')
dados

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
...,...,...,...,...,...,...,...,...,...
32955,Quitinete,Centro,0,0,0,27,800.0,350.0,25.0
32956,Apartamento,Jacarepaguá,3,1,2,78,1800.0,800.0,40.0
32957,Apartamento,São Francisco Xavier,2,1,0,48,1400.0,509.0,37.0
32958,Apartamento,Leblon,2,0,0,70,3000.0,760.0,NaN
32959,Conjunto Comercial/Sala,Centro,0,0,0,250,6500.0,4206.0,1109.0

## Mostrar o tipo de dados que estão armazenados

In [5]:
type(dados)

pandas.core.frame.DataFrame

## Mais informações

In [6]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

## Pegar os 5 primeiros dados / 10 primeiros dados

In [7]:
dados.head()

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN

In [8]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

## dtypes() exibe apenas os tipos das variáveis,

In [9]:
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [10]:
tipos_de_dados = pd.DataFrame(dados.dtypes, columns = ['Tipo de Dados'])

In [11]:
tipos_de_dados.columns.name = "Varaveis"

In [12]:
tipos_de_dados

Varaveis   Tipo de Dados
Tipo              object
Bairro            object
Quartos            int64
Vagas              int64
Suites             int64
Area               int64
Valor            float64
Condominio       float64
IPTU             float64

## Quantidade de informações

In [13]:
dados.shape

(32960, 9)

## Lendo arquivos json

In [15]:
json = open('extras/dados/aluguel.json')
print(json.read())

[{"Tipo":"Quitinete","Bairro":"Copacabana","Quartos":1,"Vagas":0,"Suites":0,"Area":40,"Valor":1700.0,"Condominio":500.0,"IPTU":60.0},
{"Tipo":"Casa","Bairro":"Jardim Bot\u00e2nico","Quartos":2,"Vagas":0,"Suites":1,"Area":100,"Valor":7000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Barra da Tijuca","Quartos":0,"Vagas":4,"Suites":0,"Area":150,"Valor":5200.0,"Condominio":4020.0,"IPTU":1111.0},
{"Tipo":"Apartamento","Bairro":"Centro","Quartos":1,"Vagas":0,"Suites":0,"Area":15,"Valor":800.0,"Condominio":390.0,"IPTU":20.0},
{"Tipo":"Apartamento","Bairro":"Higien\u00f3polis","Quartos":1,"Vagas":0,"Suites":0,"Area":48,"Valor":800.0,"Condominio":230.0,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Vista Alegre","Quartos":3,"Vagas":1,"Suites":0,"Area":70,"Valor":1200.0,"Condominio":null,"IPTU":null},
{"Tipo":"Apartamento","Bairro":"Cachambi","Quartos":2,"Vagas":0,"Suites":0,"Area":50,"Valor":1300.0,"Condominio":301.0,"IPTU":17.0},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Barra da Tijuca","Quartos":5,"Vagas":4,"Suites":5,"Area":750,"Valor":22000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Casa de Condom\u00ednio","Bairro":"Ramos","Quartos":2,"Vagas":2,"Suites":0,"Area":65,"Valor":1000.0,"Condominio":null,"IPTU":null},
{"Tipo":"Conjunto Comercial\/Sala","Bairro":"Centro","Quartos":0,"Vagas":3,"Suites":0,"Area":695,"Valor":35000.0,"Condominio":19193.0,"IPTU":3030.0}]

In [16]:
df_json = pd.read_json("extras/dados/aluguel.json")
df_json

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

## Lendo arquivo TXT

In [18]:
txt = open('extras/dados/aluguel.txt')
print(txt.read())

Tipo	Bairro	Quartos	Vagas	Suites	Area	Valor	Condominio	IPTU
Quitinete	Copacabana	1	0	0	40	1700	500	60
Casa	Jardim Botânico	2	0	1	100	7000
Conjunto Comercial/Sala	Barra da Tijuca	0	4	0	150	5200	4020	1111
Apartamento	Centro	1	0	0	15	800	390	20
Apartamento	Higienópolis	1	0	0	48	800	230
Apartamento	Vista Alegre	3	1	0	70	1200
Apartamento	Cachambi	2	0	0	50	1300	301	17
Casa de Condomínio	Barra da Tijuca	5	4	5	750	22000
Casa de Condomínio	Ramos	2	2	0	65	1000
Conjunto Comercial/Sala	Centro	0	3	0	695	35000	19193	3030

In [19]:
df_txt = pd.read_table('extras/dados/aluguel.txt')
df_txt

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

## Lendo arquivos do EXcel

In [21]:
df_xlsx = pd.read_excel('extras/dados/aluguel.xlsx')
df_xlsx

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000,19193.0,3030.0

## Lendo pagina html

In [24]:
df_html = pd.read_html('https://www.federalreserve.gov/releases/h3/current/default.htm')
df_html

[                  Date      Reserve balances required  \
                   Date Reserve balance requirements 1
 0              Month 7                        Month 7
 1            Aug. 2019                         134639
 2           Sept. 2019                         134707
 3            Oct. 2019                         134998
 4            Nov. 2019                         140705
 5            Dec. 2019                         138984
 6            Jan. 2020                         144816
 7            Feb. 2020                         138370
 8            Mar. 2020                         113139
 9            Apr. 2020                              0
 10            May 2020                              0
 11           June 2020                              0
 12           July 2020                              0
 13           Aug. 2020                              0
 14                 NaN                            NaN
 15  Two weeks ending 8             Two weeks ending 8
 16       July 15, 2020                              0
 17       July 29, 2020                              0
 18       Aug. 12, 2020                              0
 19       Aug. 26, 2020                              0
 20       Sept. 9, 2020                              0

                                                                \
    Top of penalty- free band 2 Bottom of penalty- free band 3
 0                      Month 7                        Month 7
 1                       148114                         121167
 2                       148188                         121227
 3                       148509                         121489
 4                       154787                         126625
 5                       152893                         125076
 6                       159309                         130326
 7                       152218                         124524
 8                       124461                         101817
 9                            0                              0
 10                           0                              0
 11                           0                              0
 12                           0                              0
 13                           0                              0
 14                         NaN                            NaN
 15          Two weeks ending 8             Two weeks ending 8
 16                           0                              0
 17                           0                              0
 18                           0                              0
 19                           0                              0
 20                           0                              0

    Reserve balances maintained 4  \
                            Total
 0                        Month 7
 1                        1520876
 2                        1439771
 3                        1481513
 4                        1529341
 5                        1630090
 6                        1645384
 7                        1656989
 8                        2045148
 9                        2953586
 10                       3217635
 11                       3043556
 12                       2718529
 13                       2799719
 14                           NaN
 15            Two weeks ending 8
 16                       2795785
 17                       2623526
 18                       2751124
 19                       2821740
 20                       2854690

                                                                   \
    Balances maintained to satisfy reserve balance requirements 5
 0                                             Month 7
 1                                              147555
 2                                              147498
 3                                              148050
 4                                              154256
 5                                              152562
 6                                              158765
 7                                              151612
 8                                              124147
 9                                                   0
 10                                                  0
 11                                                  0
 12                                                  0
 13                                                  0
 14                                                NaN
 15                                 Two weeks ending 8
 16                                                  0
 17                                                  0
 18                                                  0
 19                                                  0
 20                                                  0


    Balances maintained that exceed the top of the penalty- free band 6
 0                                             Month 7
 1                                             1373321
 2                                             1292273
 3                                             1333462
 4                                             1375085
 5                                             1477528
 6                                             1486619
 7                                             1505377
 8                                             1921000
 9                                             2953586
 10                                            3217635
 11                                            3043556
 12                                            2718529
 13                                            2799719
 14                                                NaN
 15                                 Two weeks ending 8
 16                                            2795785
 17                                            2623526
 18                                            2751124
 19                                            2821740
 20                                            2854690                   ,
                   Date            Reserves                      \
                   Date             Total 1            Required
 0              Month 7             Month 7             Month 7
 1            Aug. 2019             1586844              200608
 2           Sept. 2019             1504805              199741
 3            Oct. 2019             1547136              200621
 4            Nov. 2019             1595222              206586
 5            Dec. 2019             1698344              207239
 6            Jan. 2020             1715219              214652
 7            Feb. 2020             1726943              208324
 8            Mar. 2020             2099369              167360
 9            Apr. 2020             2953586                   0
 10            May 2020             3217635                   0
 11           June 2020             3043556                   0
 12           July 2020             2718529                   0
 13           Aug. 2020             2799719                   0
 14                 NaN                 NaN                 NaN
 15  Two weeks ending 8  Two weeks ending 8  Two weeks ending 8
 16       July 15, 2020             2795785                   0
 17       July 29, 2020             2623526                   0
 18       Aug. 12, 2020             2751124                   0
 19       Aug. 26, 2020             2821740                   0
 20       Sept. 9, 2020             2854690                   0

           Vault cash 2                                      \
                  Total Used to satisfy required reserves 3
 0              Month 7                             Month 7
 1                78451                               65969
 2                76550                               65035
 3                76660                               65623
 4                76921                               65881
 5                80168                               68255
 6                81216                               69835
 7                80735                               69954
 8                77114                               54222
 9                88104                                   0
 10              101345                                   0
 11              104201                                   0
 12               98392                                   0
 13               95327                                   0
 14                 NaN                                 NaN
 15  Two weeks ending 8                  Two weeks ending 8
 16               99459                                   0
 17               97225                                   0
 18               95638                                   0
 19               95066                                   0
 20               95313                                   0

                              Monetary base                              \
              Surplus 4             Total 5 Total balances maintained 6
 0              Month 7             Month 7                     Month 7
 1                12483             3271378                     1520876
 2                11516             3202668                     1439771
 3                11037             3252807                     1481513
 4                11040             3315551                     1529341
 5                11914             3426464                     1630090
 6                11381             3442569                     1645384
 7                10781             3454474                     1656989
 8                22892             3883155                     2045148
 9                88104             4844940                     2953586
 10              101345             5149527                     3217635
 11              104201             5001978                     3043556
 12               98392             4700365                     2718529
 13               95327             4807394                     2799719
 14                 NaN                 NaN                         NaN
 15  Two weeks ending 8  Two weeks ending 8          Two weeks ending 8
 16               99459             4772522                     2795785
 17               97225             4609143                     2623526
 18               95638             4750981                     2751124
 19               95066             4830999                     2821740
 20               95313             4876690                     2854690


    Currency in circulation
 0                  Month 7
 1                  1750502
 2                  1762898
 3                  1771294
 4                  1786209
 5                  1796375
 6                  1797185
 7                  1797485
 8                  1838007
 9                  1891355
 10                 1931891
 11                 1958422
 12                 1981836
 13                 2007675
 14                     NaN
 15      Two weeks ending 8
 16                 1976737
 17                 1985617
 18                 1999857
 19                 2009260
 20                 2022000  ,
                   Date Borrowings from the Federal Reserve  \
                   Date                               Total
 0              Month 3                             Month 3
 1            Aug. 2019                                 117
 2           Sept. 2019                                 101
 3            Oct. 2019                                  63
 4            Nov. 2019                                  26
 5            Dec. 2019                                  21
 6            Jan. 2020                                   6
 7            Feb. 2020                                   3
 8            Mar. 2020                               40554
 9            Apr. 2020                              124461
 10            May 2020                              111845
 11           June 2020                               97671
 12           July 2020                               92943
 13           Aug. 2020                               83126
 14                 NaN                                 NaN
 15  Two weeks ending 4                  Two weeks ending 4
 16       July 15, 2020                               94326
 17       July 29, 2020                               92428
 18       Aug. 12, 2020                               85636
 19       Aug. 26, 2020                               82030
 20       Sept. 9, 2020                               80170

                                                                 \
                Primary           Secondary            Seasonal
 0              Month 3             Month 3             Month 3
 1                   16                   0                 101
 2                   15                   0                  86
 3                    4                   0                  59
 4                    4                   0                  22
 5                   10                   0                  11
 6                    5                   0                   1
 7                    3                   0                   0
 8                19538                   0                   0
 9                38299                   0                   0
 10               22180                   0                   2
 11                8456                   0                  11
 12                4670                   0                  26
 13                2851                   0                  38
 14                 NaN                 NaN                 NaN
 15  Two weeks ending 4  Two weeks ending 4  Two weeks ending 4
 16                5055                   0                  21
 17                4376                   0                  31
 18                3111                   0                  37
 19                2651                   0                  41
 20                2786                   0                  34

                              Nonborrowed reserves 2
    Other credit extensions 1 Nonborrowed reserves 2
 0                    Month 3                Month 3
 1                          0                1586727
 2                          0                1504704
 3                          0                1547073
 4                          0                1595196
 5                          0                1698323
 6                          0                1715213
 7                          0                1726939
 8                      21015                2058816
 9                      86162                2829125
 10                     89663                3105791
 11                     89204                2945885
 12                     88248                2625585
 13                     80237                2716593
 14                       NaN                    NaN
 15        Two weeks ending 4     Two weeks ending 4
 16                     89251                2701459
 17                     88021                2531099
 18                     82488                2665489
 19                     79339                2739710
 20                     77350                2774520  ]